unicab369/CH-Mess/ch32-mess/2_Device/mng_i2c.h
#include "ch32fun.h"

#include "../Mess-libs/i2c/lib_i2c.h"
#include "../Mess-libs/i2c/ssd1306/mod_ssd1306.h"

#ifndef PACKED
#define PACKED __attribute__((packed))
#endif

i2c_device_t dev_ssd1306 = {
	.clkr = I2C_CLK_100KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x3C,				// Default address for SSD1306
	.regb = 1,
};

/* send OLED command byte */
uint8_t ssd1306_cmd(uint8_t cmd) {
	uint8_t pkt[2];
	pkt[0] = 0;
	pkt[1] = cmd;
	return i2c_write_raw(&dev_ssd1306, pkt, 2);
}

/* send OLED data packet (up to 32 bytes) */
uint8_t ssd1306_data(uint8_t *data, int sz) {
	uint8_t pkt[33];
	pkt[0] = 0x40;
	memcpy(&pkt[1], data, sz);
	return i2c_write_raw(&dev_ssd1306, pkt, sz+1);
}


//! BH1750
#define BH17_CONT_HI1 0x10      // 1 lux resolution 120ms
#define BH17_CONT_HI2 0x11      // .5 lux resolution 120ms
#define BH17_CONT_LOW 0x13      // 4 lux resolution 16ms
#define BH17_ONCE_HI1 0x20      // 1 lux resolution 120ms
#define BH17_ONCE_HI2 0x21      // .5 lux resolution 120ms
#define BH17_ONCE_LOW 0x23      // 4 lux resolution 16ms
#define BH17_RESET 0x07
#define BH17_POWER_ON 0x01


//! SHT30
uint8_t SHT_RESET_CMD[2]        = { 0x30, 0xA2 };
uint8_t SHT_HIGHREP_HOLD_CMD[2] = { 0x2C, 0x06 };
uint8_t SHT_MEDREP_HOLD_CMD[2]  = { 0x2C, 0x0D };
uint8_t SHT_LOWREP_HOLD_CMD[2]  = { 0x2C, 0x10 };
uint8_t SHT_HIGHREP_FREE_CMD[2] = { 0x24, 0x00 };
uint8_t SHT_MEDREP_FREE_CMD[2]  = { 0x24, 0x0B };
uint8_t SHT_LOWREP_FREE_CMD[2]  = { 0x24, 0x16 };
uint8_t SHT_HEATER_DISABLE[2]   = { 0x30, 0x66 };
uint8_t SHT_HEATER_ENABLE[2]    = { 0x30, 0x6D };

static const i2c_device_t dev_ds3231 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x68,				//! Default address for DS3231
	.regb = 1,
};

static const i2c_device_t dev_aht21 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x38,				// Default address for AHT21
	.regb = 1,
};

static const i2c_device_t dev_htu21 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x40,				//! Default address for HTU21
	.regb = 1,
};

static const i2c_device_t dev_bmp280 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x76, 				// Default address for BMP280
	.regb = 1,
};

static const i2c_device_t dev_hdc1080 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x40, 				//! Default address for HDc1080
	.regb = 1,
};

static const i2c_device_t dev_si7021 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x40, 				//! Default address for SI7021
	.regb = 1,
};

static const i2c_device_t dev_max44009 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x4A,		 		// Default address for MAX44009
	.regb = 1,
};

static const i2c_device_t dev_AP3216 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x1E,				// Default address for AP3216
	.regb = 1,
};

static const i2c_device_t dev_vl35lox = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x29,				// Default address for VL53L0X
	.regb = 1,
};

static const i2c_device_t dev_ens160 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x53,				// Default address for ENS160
	.regb = 1,
};

static const i2c_device_t dev_sgp30 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x58,				// Default address for SGP30
	.regb = 1,
};

static const i2c_device_t dev_scd40 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x62,				// Default address for SCD40
	.regb = 1,
};

static const i2c_device_t dev_mpu6050 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x68,				//! Default address for MPU6050
	.regb = 1,
};

static const i2c_device_t dev_adxl345 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x53,				// Default address for ADXL345
	.regb = 1,
};

static const i2c_device_t dev_at24c = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x57,				// Default address for AT24C32
	.regb = 1,
};

static const i2c_device_t dev_ina3221 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x42,				//! Default address for INA3221
	.regb = 1,				
};

static const i2c_device_t dev_as5600 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x36,				// Default address for AS5600
	.regb = 1,
};

static const i2c_device_t dev_max30102 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x57,				//! Default address for MAX30102
	.regb = 1,
};

static const i2c_device_t dev_amg88xx = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x69,				// Default address for AMG88XX
	.regb = 1,
};

static const i2c_device_t dev_bh1750 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x23,				// Default address for BH1750
	.regb = 1,
};

static const i2c_device_t dev_sht3x = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x44,				// Default address for SHT30
	.regb = 1,
};

static const i2c_device_t dev_ina219 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x40,				//! Default address for INA219
	.regb = 1,
};

static const i2c_device_t dev_apds9960 = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x39,				// Default address for APDS9960
	.regb = 1,
};

static const i2c_device_t dev_v003Slave = {
	.clkr = I2C_CLK_400KHZ,
	.type = I2C_ADDR_7BIT,
	.addr = 0x77,				// Default address for V003 Slave
	.regb = 1,
};

uint16_t hexToDecimal(const uint8_t* hexArray, size_t length) {
	uint16_t result = 0;
	
	for (size_t i = 0; i < length; i++) {
		result = (result << 8) | hexArray[i];
	}
	
	return result;
}

void i2c_getReadings(struct SensorData* data) {
   // uint16_t lux = 0;
	// uint16_t tempC = 0, tempF = 0, hum = 0;
	// uint16_t busVoltage = 0, mA = 0;

	//! BH1750 Reading
	// int check = I2CTest(BH17_ADDR);

	// if (check) { 
	// 	data->lux = BH17_Read(); 
	// }

	// char strOut[32];
	// mini_snprintf(strOut, sizeof(strOut), "\nlux=%lu", lux);
	// printf(strOut);
	// ssd1306_drawstr_sz(0, 16, strOut, 1, fontsize_8x8);

	// //! SHT31 Reading
	// int check2 = I2CTest(SHT3_ADDR);

	// if (check2) {
	// 	I2CWrite(SHT3_ADDR, SHT_LOWREP_FREE_CMD, sizeof(SHT_LOWREP_FREE_CMD));
	// 	Delay_Ms(5);
	// 	uint8_t buff[6];
	// 	I2CRead(SHT3_ADDR, buff, 6);

