unicab369/CH-Mess/ch32-mess/2_Device/mng_i2c.h
	// 	uint16_t rawTemp = 0, rawHum = 0;
	// 	rawTemp = (buff[0]<<8) + buff[1];
	// 	rawHum = (buff[3]<<8) + buff[4];

	// 	// tempC = rawTemp*175/65535 - 45;
	// 	data->tempF = rawTemp*63/13107 - 49;
	// 	data->hum = rawHum*100/65535;
	// }

	// mini_snprintf(strOut, sizeof(strOut), "\nt=%lu, h=%lu", tempF, hum);
	// printf(strOut);

	// //! INA219 Reading
	// int check3 = I2CTest(INA219_ADDR);

	// if (check3) {
	// 	data->voltage = INA219_Read();
	// }

   // printf("\n\rtemp=%lu, hum=%lu, lux=%lu, v=%lu, mA=%lu", tempC, hum, lux, busVoltage, mA);
   // mini_snprintf(strOut, sizeof(strOut), "\nV=%lu, mA=%lu", busVoltage, mA);
   // printf(strOut);		

   // uint8_t allValues[] = { 0xB1, 0xCA, 0xFF, 0xFF, 0xFF, 0xFF, 0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0x00, 0x0D, 0x0A };
   // uint16_t allValues[] = { 0xCAB1, 0xFFFF, 0xFFFF, tempF, hum, lux, busVoltage, 0x0A0D };
}


i2c_err_t ret;
uint8_t buff[8];

void test_htu21() {
	Delay_Ms(100);
	ret = i2c_write_raw(&dev_htu21, (uint8_t[]){0xFE}, 1);		// Soft reset
	printf("Error0: %d\n", ret);

	// Delay_Ms(100);
	// ret = i2c_read_reg(&dev_htu21, 0xE7, buff, 3);		// Read User register
	// printf("Error1: %d\n", ret);
	// printf("HTU21 User Register: %02X, %02X, %02X\n", buff[0], buff[1], buff[2]);


	Delay_Ms(200);
	// ret = i2c_read_reg(&dev_htu21, 0xF3, buff, 3);				// Read Temperature
	ret = i2c_write_raw(&dev_htu21, (uint8_t[]){0xF3}, 1);
	printf("Error3: %d\n", ret);

	Delay_Ms(200);
	ret = i2c_read_raw(&dev_htu21, buff, 3);				// Read Temperature
	printf("Error4: %d\n", ret);
	uint16_t temp_raw = (buff[0] << 8) | buff[1];
	uint16_t temp = (temp_raw * 17572) >> 16;					// >> 16 is equivalent to / 65536

	Delay_Ms(200);
	// ret = i2c_read_reg(&dev_htu21, 0xF5, buff, 3);				// Read Humidity
	ret = i2c_write_raw(&dev_htu21, (uint8_t[]){0xF5}, 1);
	printf("Error4: %d\n", ret);

	Delay_Ms(200);
	ret = i2c_read_raw(&dev_htu21, buff, 3);				// Read Humidity
	printf("Error5: %d\n", ret);
	uint16_t hum_raw = (buff[0] << 8) | buff[1];
	uint16_t hum = (hum_raw * 125) >> 16;							// >> 16 is equivalent to / 65536

	printf("HTU21 Temp*100: %d, Hum: %d\n", temp, hum);
}

void test_aht21() {
	ret = i2c_read_reg(&dev_aht21, 0x71, buff, 1);
	buff[0] = buff[0] & 0x18;
	printf("Error0: %d\n", ret);
	printf("AHT21 Read reg 0x71: %02X\n", buff[0]);		// expect 0x18

	buff[0] = 0xAC;
	buff[1] = 0X33;
	buff[2] = 0x00;
	ret = i2c_write_raw(&dev_aht21, buff, 3);
	printf("Error1: %d\n", ret);

	ret = i2c_read_raw(&dev_aht21, buff, 6);		// Read sensor
	printf("Error2: %d\n", ret);

	// calculate humidity
	uint32_t hum = (buff[1] << 12) | (buff[2] << 4) | (buff[3] >> 4);
	hum = (hum * 100) / 0x100000;
	printf("Humidity: %lu\n", hum);

	// calculate temperature
	uint32_t temp = ((buff[3] & 0xF) << 16) | (buff[4] << 8) | (buff[5]);
	temp = (temp * 200) / 0x100000;
	printf("Temperature: %lu\n", temp);
}

void test_bmp280() {
	struct {
		int16_t dig_T1;
		int16_t dig_T2;
		int16_t dig_T3;
		// Pressure calibration would be added similarly
	} bmp280_calib;

	ret = i2c_read_reg(&dev_bmp280, 0xD0, buff, 1);
	printf("Error0: %d\n", ret);
	printf("BMP280 Read reg 0xD0: %02X\n", buff[0]);		// expect 0x58

	ret = i2c_read_reg(&dev_bmp280, 0x88, buff, 2);
	bmp280_calib.dig_T1 =  (int16_t)(buff[1] << 8) | buff[0];

	ret = i2c_read_reg(&dev_bmp280, 0x8A, buff, 2);
	bmp280_calib.dig_T2 =  (int16_t)(buff[1] << 8) | buff[0];

	ret = i2c_read_reg(&dev_bmp280, 0x8C, buff, 2);
	bmp280_calib.dig_T3 =  (int16_t)(buff[1] << 8) | buff[0];

	printf("dig_T1: %lu\n", bmp280_calib.dig_T1);
	printf("dig_T2: %lu\n", bmp280_calib.dig_T2);
	printf("dig_T3: %ld\n", bmp280_calib.dig_T3);

	ret = i2c_write_reg(&dev_bmp280, 0xF4, (uint8_t[]){0x5D}, 1);
	printf("Error1: %d\n", ret);
	ret = i2c_read_reg(&dev_bmp280, 0xF7, buff, 6);			// read sensors

	uint32_t raw_pressure = (uint32_t)(buff[0]*4096 + buff[1]*16 + (buff[2]/16));
	uint32_t raw_temp = (uint32_t)(buff[3]*4096 + buff[4]*16 + (buff[5]/16));

	uint32_t var1 = (raw_temp/16384 - bmp280_calib.dig_T1/1024) * bmp280_calib.dig_T2;
	uint32_t var2 = ((raw_temp/131072 - bmp280_calib.dig_T1/8192) * (raw_temp/131072 - bmp280_calib.dig_T1/8192)) * bmp280_calib.dig_T3;
	uint32_t t_fine = var1 + var2;		// t_fine in 0.01 degrees Celsius

	uint32_t temp = t_fine/5120;
	printf("Temperature: %lu\n", temp);

}

void test_hdc1080() {
	ret = i2c_write_reg(&dev_hdc1080, 0x02, (uint8_t[]){0x10}, 1);	// Set configuration register
	printf("Error0: %d\n", ret);

	ret = i2c_write_raw(&dev_hdc1080, (uint8_t[]){0x00}, 1);		// Trigger measurement
	printf("Error1: %d\n", ret);

	Delay_Ms(100);											//! Wait for measurement to complete
	ret = i2c_read_raw(&dev_hdc1080, buff, 4);				// Read data register
	printf("Error2: %d\n", ret);
	printf("HDC1080 Read: %02X %02X %02X %02X\n", buff[0], buff[1], buff[2], buff[3]);

	uint16_t raw_temp = (buff[0] << 8) | buff[1];
	uint16_t raw_hum = (buff[2] << 8) | buff[3];

	uint32_t temp = (raw_temp * 165 / 65536) - 40;
	uint32_t hum = (raw_hum * 100 / 65536);

	printf("Temperature: %lu\n", temp);
	printf("Humidity: %lu\n", hum);
}

void test_si7021() {
	ret = i2c_write_raw(&dev_si7021, (uint8_t[]){0xE3}, 1);
	printf("Error0: %d\n", ret);

	ret = i2c_read_raw(&dev_si7021, buff, 4);				// Read Temperature and Humidity
	printf("Error0: %d\n", ret);

	uint16_t raw_temp = (buff[0] << 8) | buff[1];
	uint32_t temp = ((raw_temp * 17572) >> 16) - 4685;		// >> 16 is equivalent to / 65536
	printf("Temp*100: %lu\n", temp);

	uint16_t raw_hum = (buff[2] << 8) | buff[3];
	uint32_t hum = ((raw_hum * 12500) >> 16) - 600;
	printf("Hum*100: %lu\n", hum);
}

void test_max44009() {
	ret = i2c_read_reg(&dev_max44009, 0x03, buff, 2);		// Read lux registers
	printf("Error0: %d\n", ret);

	int exponent = (buff[0] & 0xF0) >> 4;		// Get exponent from first byte
	int mantissa = ((buff[0] & 0x0F)) << 4 | (buff[1] & 0x0F);	// Get mantissa from both bytes

	uint16_t lux = (1 << exponent) * mantissa * 45;
	printf("Max44009: %02X %02X\n", buff[0], buff[1]);
	printf("lux*1000: %lu\n", lux);
}

void test_ap3216() {
	ret = i2c_write_raw(&dev_AP3216, (uint8_t[]){0x00, 0x03}, 2);		// Trigger measurement
	printf("Error0: %d\n", ret);

	ret = i2c_read_reg(&dev_AP3216, 0x0C, buff, 4);		// Read data registers
	printf("Error1: %d\n", ret);

	uint16_t lux = (buff[1] << 8) + buff[0];

