unicab369/CH-Mess/ch32-mess/2_Device/mng_i2c.h
	uint8_t low_byte = buff[2] & 0b00001111;		// Get low byte of lux
	uint8_t high_byte = buff[3] & 0x00111111;		// Get high byte of lux
	uint16_t proximity = (high_byte << 4) + low_byte;
	printf("lux: %d, proximity: %d\n", lux, proximity);
}

void test_vl53l0x() {
	// ret = i2c_write_raw(&dev_vl35lox, (uint8_t[]){0x00, 0x01}, 2);		// Trigger measurement

	uint8_t status;
	ret = i2c_read_reg(&dev_vl35lox, 0xC0, &status, 1);		// Read system status register
	printf("Error0: %d\n", ret);
	printf("status: %02X\n", status);						// expect 0xEE
	
	// ret = i2c_write_reg(&dev_vl35lox, 0x88, (uint8_t[]){0x00}, 1);		// Start initialization

	// ret = i2c_write_reg(&dev_vl35lox, 0x80, (uint8_t[]){0x01}, 1);
	// ret = i2c_write_reg(&dev_vl35lox, 0xFF, (uint8_t[]){0x01}, 1);
	// ret = i2c_write_reg(&dev_vl35lox, 0x00, (uint8_t[]){0x00}, 1);

	// // ret = i2c_read_reg(&dev_vl35lox, 0x91, buff, 1);		// Read I2C mode register
	// // printf("Error1: %d\n", ret);
	// // printf("VL53L0X Read reg 0x91: %02X\n", buff[0]);		// expect 0x3C
	// ret = i2c_write_reg(&dev_vl35lox, 0x91, (uint8_t[]){0x3C}, 1);		// Set I2C mode

	// ret = i2c_write_reg(&dev_vl35lox, 0x00, (uint8_t[]){0x01}, 1);
	// ret = i2c_write_reg(&dev_vl35lox, 0xFF, (uint8_t[]){0x00}, 1);
	// ret = i2c_write_reg(&dev_vl35lox, 0x80, (uint8_t[]){0x00}, 1);

	// start measurement
	ret = i2c_write_reg(&dev_vl35lox, 0x00, (uint8_t[]){0x00}, 1);

	Delay_Ms(100);											// Wait for measurement to complete

	ret = i2c_read_reg(&dev_vl35lox, 0x13, buff, 1);
	printf("Error0: %d\n", ret);
	printf("VL53L0X Read reg 0x13: %02X\n", buff[0]);

	Delay_Ms(100);	
	ret = i2c_read_reg(&dev_vl35lox, 0x14 + 10, buff, 2);				// Read distance register
	printf("Error1: %d\n", ret);

	printf("VL53L0X Read: %02X %02X\n", buff[0], buff[1]);
	uint16_t distance = (buff[1] << 8) + buff[0];
	printf("distance: %d\n", distance);
}

void test_ens160() {
	ret = i2c_read_reg(&dev_ens160, 0x00, buff, 2);		// Read ENS160 ID
	uint16_t ens160_id = (buff[1] << 8) | buff[0];
	printf("ENS160 ID: %04X\n", ens160_id);
	ret = i2c_write_reg(&dev_ens160, 0x10, (uint8_t[]){0x02}, 1);		// set Mode

	// get Air Quality Index (AQI)
	// value: 1 - excelent, 2 - good, 3 - fair, 4 - poor, 5 - very poor
	ret = i2c_read_reg(&dev_ens160, 0x21, buff, 5);		
	printf("ENS160 AQI: %d\n", buff[0]);

	// get Total Volatile Organic Compounds (TVOC)
	// value range: 0 - 65000 ppb	
	uint16_t tvoc = (buff[2] << 8) | buff[1];
	printf("ENS160 TVOC: %d\n", tvoc);

	// get Equivalent CO2 (eCO2)
	// value range: 400 - 65535 ppm
	// level Excelent: 400 - 600 ppm, Good: 600 - 800 ppm, Fair: 800 - 1000 ppm, Poor: 1000 - 1500 ppm, Unhealthy: >1500	
	uint16_t eco2 = (buff[4] << 8) | buff[3];
	printf("ENS160 eCO2: %d\n", eco2);
}

void test_sgp30() {
	ret = i2c_write_raw(&dev_sgp30, (uint8_t[]){0x36, 0x82}, 2);
	printf("Error0: %d\n", ret);					// Initialize SGP30
	ret = i2c_read_raw(&dev_sgp30, buff, 3);		// Read ID
	printf("Error1: %d\n", ret);
	uint32_t id = (buff[0] << 16) | (buff[1] << 8) | buff[2];		// Get ID	
	printf("SGP30 ID: %04X\n", id);

	ret = i2c_write_raw(&dev_sgp30, (uint8_t[]){0x20, 0x03}, 2);
	printf("Error2: %d\n", ret);		// Initialize SGP30	

	ret = i2c_write_raw(&dev_sgp30, (uint8_t[]){0x20, 0x08}, 2);
	printf("Error0: %d\n", ret);		// Start measurement

	Delay_Ms(100);		// Wait for measurement
	ret = i2c_read_raw(&dev_sgp30, buff, 6);		// Read sensor data
	printf("Error1: %d\n", ret);
	uint16_t co2 = (buff[0] << 8) | buff[1];		// CO2 in ppm
	uint16_t tvoc = (buff[3] << 8) | buff[4];		// TVOC in ppb

	ret = i2c_write_raw(&dev_sgp30, (uint8_t[]){0x20, 0x50}, 2);
	printf("Error2: %d\n", ret);		// Set baseline

	Delay_Ms(100);		// Wait for baseline to be
	ret = i2c_read_raw(&dev_sgp30, buff, 6);		// Read baseline data
	printf("Error3: %d\n", ret);
	uint16_t h2 = (buff[0] << 8) | buff[1];			// H2 baseline
	uint16_t ethanol = (buff[3] << 8) | buff[4];	// Ethanol baseline

	printf("SGP30 CO2: %d ppm, TVOC: %d ppb\n", co2, tvoc);
	printf("SGP30 H2: %d, Ethanol: %d\n", h2, ethanol);
}

void test_scd40() {
	ret = i2c_write_raw(&dev_scd40, (uint8_t[]){0x36, 0xF6}, 2); 	// wake up
	printf("Error0: %d\n", ret);

	ret = i2c_write_raw(&dev_scd40, (uint8_t[]){0x21, 0xB1}, 2);	// periodic measurement
	printf("Error0: %d\n", ret);

	ret = i2c_write_raw(&dev_scd40, (uint8_t[]){0xEC, 0x05}, 2);	// read measurement
	printf("Error1: %d\n", ret);
	
	ret = i2c_read_raw(&dev_scd40, buff, 8);		// Read sensor data
	printf("Error2: %d\n", ret);

	uint16_t co2 = (buff[0] << 8) | buff[1];		// CO2 in ppm
	uint16_t temp_raw = (buff[3] << 8) | buff[4];	
	uint16_t temp = (temp_raw * 175) >> 16;			// >> 16 is equivalent to / 65536
	uint16_t hum_raw = (buff[6] << 8) | buff[6];
	uint16_t hum = (hum_raw * 100) >> 16;			// >> 16 is equivalent to / 65536

	printf("SCD40 CO2: %d ppm, Temp: %d, Hum: %d\n", co2, temp, hum);
}

void test_mpu6050() {
	ret = i2c_write_reg(&dev_mpu6050, 0x6B, (uint8_t[]){0x00}, 1);	// Reset MPU6050

	ret = i2c_read_reg(&dev_mpu6050, 0x3B, buff, 6);
	uint16_t acc_x = (buff[0] << 8) | buff[1];
	uint16_t acc_y = (buff[2] << 8) | buff[3];
	uint16_t acc_z = (buff[4] << 8) | buff[5];
	printf("MPU6050 acc_x: %d, acc_y: %d, acc_z: %d\n", acc_x, acc_y, acc_z);

	ret = i2c_read_reg(&dev_mpu6050, 0x43, buff, 6);
	uint16_t gyro_x = (buff[0] << 8) | buff[1];
	uint16_t gyro_y = (buff[2] << 8) | buff[3];
	uint16_t gyro_z = (buff[4] << 8) | buff[5];
	printf("MPU6050 gyro_x: %d, gyro_y: %d, gyro_z: %d\n", gyro_x, gyro_y, gyro_z);
}

void test_adxl345() {
	ret = i2c_write_reg(&dev_adxl345, 0x2D, (uint8_t[]){0x08}, 1);	// Set power mode to measurement
	printf("Error0: %d\n", ret);

	ret = i2c_read_reg(&dev_adxl345, 0x32, buff, 6);
	uint16_t x = (buff[1] << 8) | buff[0];
	uint16_t y = (buff[3] << 8) | buff[2];
	uint16_t z = (buff[5] << 8) | buff[4];
	printf("ADXL345 x: %d, y: %d, z: %d\n", x, y, z);
}

void test_ina3221() {
	ret = i2c_read_reg(&dev_ina3221, 0x00, buff, 2);
	printf("Error0: %d\n", ret);
	printf("INA3221: %02X %02X\n", buff[0], buff[1]);

	// ret = i2c_write_reg(&dev_ina3221, 0x00, (uint8_t[]){0xF1, 0x27}, 2); // Reset + 128x avg
	// printf("Config Error: %d\n", ret);
	// Delay_Ms(100);

	ret = i2c_write_raw(&dev_ina3221, (uint8_t[]){0x00, 0xF1, 0x26}, 3); // Reset + 128x avg
	printf("Error: %d\n", ret);

	Delay_Ms(100);
	ret = i2c_read_reg(&dev_ina3221, 0x00, buff, 2);
	printf("Error0: %d\n", ret);
	printf("INA3221: %02X %02X\n", buff[0], buff[1]);

