unicab369/CH-Mess/ch32-mess/2_Device/mng_i2c.h
	// // Read all 6 registers (shunt1, bus1, shunt2, bus2, shunt3, bus3)
	// ret = i2c_read_reg(&dev_ina3221, 0x01, buff, 12); // Reads 0x01-0x0C
	// printf("Read Error: %d\n", ret);

	// // Extract raw values (signed!)
	// int16_t ch0_shunt_raw = (buff[0] << 8) | buff[1];   // 0x01-0x02
	// int16_t ch0_bus_raw   = (buff[2] << 8) | buff[3];   // 0x03-0x04 (NOTE: 0x02 is skipped!)
	// int16_t ch1_shunt_raw = (buff[4] << 8) | buff[5];   // 0x05-0x06
	// int16_t ch1_bus_raw   = (buff[6] << 8) | buff[7];   // 0x07-0x08
	// int16_t ch2_shunt_raw = (buff[8] << 8) | buff[9];   // 0x09-0x0A
	// int16_t ch2_bus_raw   = (buff[10] << 8) | buff[11]; // 0x0B-0x0C

	// // Convert to real units
	// int32_t ch0_shunt = ch0_shunt_raw * 40;      		// µV (40µV/LSB)
	// int32_t ch0_bus   = (ch0_bus_raw >> 3) * 8000; 		// µV (8mV/LSB)
	// int32_t ch1_shunt = ch1_shunt_raw * 40;     		// µV
	// int32_t ch1_bus   = (ch1_bus_raw >> 3) * 8000; 		// µV
	// int32_t ch2_shunt = ch2_shunt_raw * 40;      		// µV
	// int32_t ch2_bus   = (ch2_bus_raw >> 3) * 8000; 		// µV

	// // Print results
	// printf("Ch0: Bus=%ld uV, Shunt=%ld uV\n", ch0_bus, ch0_shunt);
	// printf("Ch1: Bus=%ld uV, Shunt=%ld uV\n", ch1_bus, ch1_shunt);
	// printf("Ch2: Bus=%ld uV, Shunt=%ld uV\n", ch2_bus, ch2_shunt);
}

void test_as5600() {
	ret = i2c_read_reg(&dev_as5600, 0x0C, buff, 4);
	printf("Error0: %d\n", ret);

	uint16_t angle_raw = (buff[0] << 8) | buff[1];
	uint16_t angle_value = (buff[2] << 8) | buff[3];
	printf("AS5600 angle_raw: %d, angle_value: %d\n", angle_raw, angle_value);
}

void test_max30102() {
	uint8_t part_id;
	ret = i2c_read_reg(&dev_max30102, 0xFF, &part_id, 1);
	printf("MAX30102: %02X\n", part_id);		// expect 0x15

	// heart rate + SP02 mode
	ret = i2c_write_reg(&dev_max30102, 0x09, (uint8_t[]){0x03}, 1);

	// set RED LED current to 36mA
	ret = i2c_write_reg(&dev_max30102, 0x0C, (uint8_t[]){0x24}, 1);

	// set IR LED current to 36mA
	ret = i2c_write_reg(&dev_max30102, 0x0D, (uint8_t[]){0x24}, 1);

	// set sample average to 4
	ret = i2c_write_reg(&dev_max30102, 0x08, (uint8_t[]){0x40}, 1);

	Delay_Ms(100);
	ret = i2c_read_reg(&dev_max30102, 0x07, buff, 6);
	uint32_t red_led = (buff[0] << 16) | (buff[1] << 8) | buff[2];
	uint32_t ir_led = (buff[3] << 16) | (buff[4] << 8) | buff[5];
	printf("MAX30102: %lu, %lu\n", red_led, ir_led);
}

void test_amg88xx() {
	uint16_t pixels[64];
	ret = i2c_read_reg(&dev_amg88xx, 0x80, buff, 128);
	printf("Error0: %d\n", ret);

	for (int i=0; i<64; i++) {
		uint16_t raw = (buff[i*2] << 8) | buff[i*2+1];
		pixels[i] = raw * .25;
	}

	// print out each line
	for (int i=0; i<8; i++) {
		printf("%lu, %lu, %lu, %lu, %lu, %lu, %lu, %lu\n", 
		pixels[i*8], pixels[i*8+1], pixels[i*8+2], pixels[i*8+3], pixels[i*8+4], pixels[i*8+5], pixels[i*8+6], pixels[i*8+7]);
	}
}


void test_bh1750() {
	if (i2c_ping(dev_bh1750.addr) != I2C_OK) {
		printf("BH1750 not found\n");
		return;
	}

	ret = i2c_write_raw(&dev_bh1750, (uint8_t[]){0x01}, 1);

	// One-time H-resolution mode
	ret = i2c_read_reg(&dev_bh1750, 0x20, buff, 2);

	uint32_t lux_raw = (buff[0] << 8) | buff[1];
	uint32_t lux = (lux_raw / 1.2);
	printf("BH1750: %lu lx\n\n", lux);
}

void test_sht3x() {
	if (i2c_ping(dev_sht3x.addr) != I2C_OK) {
		printf("SHT3X not found\n");
		return;
	}

	// Soft reset
	ret = i2c_write_reg(&dev_sht3x, 0x30, (uint8_t[]){0xA2}, 1);
	// ret = i2c_write_raw(&dev_sht3x, (uint8_t[]){0x30, 0xA2}, 2);
	Delay_Ms(20);	//! REQUIRED
	
	// High repeatability, 1 update per second
	ret = i2c_write_raw(&dev_sht3x, (uint8_t[]){0x21, 0x30}, 2);
	Delay_Ms(20);	//! REQUIRED

	ret = i2c_read_raw(&dev_sht3x, buff, 6);
	uint16_t temp_raw = (buff[0] << 8) | buff[1];
	uint16_t hum_raw = (buff[3] << 8) | buff[4];
	uint16_t temp = (175 * temp_raw) >> 16;			// >> 16 is equivalent to / 65536
	uint16_t hum = (100 * hum_raw) >> 16;			// >> 16 is equivalent to / 65536
	printf("SHT3X temp: %d, hum: %d\n\n", temp, hum);
}

void test_apds9960() {
	if (i2c_ping(dev_apds9960.addr) != I2C_OK) {
		printf("APDS9960 not found\n");
		return;
	}

	uint8_t config[] = {
		0x80,           // ENABLE
		0x0F,           // Power ON, Proximity enable, ALS enable, Wait enable
		0x90,           // CONFIG2
		0x01,           // Proximity gain control (4x)
		0x8F, 0x20,     // Proximity pulse count (8 pulses)
		0x8E, 0x87      // Proximity pulse length (16us)
	};
	ret = i2c_write_raw(&dev_apds9960, config, sizeof(config));
	Delay_Ms(50);  // Wait for sensor to initialize

	uint8_t proximity;
	ret = i2c_read_reg(&dev_apds9960, 0x9C, &proximity, 1);		// Read proximity register
	printf("APDS9960 Proximity: %d\n", proximity);

	ret = i2c_read_reg(&dev_apds9960, 0x94, buff, 8);			// Read lux registers
	uint16_t clear = (buff[1] << 8) | buff[0];
	uint16_t red = (buff[3] << 8) | buff[2];
	uint16_t green = (buff[5] << 8) | buff[4];
	uint16_t blue = (buff[7] << 8) | buff[6];
	printf("APDS9960 clear: %d, R: %d, G: %d, B: %d\n\n", clear, red, green, blue);
}

void test_ina219() {
	if (i2c_ping(dev_ina219.addr) != I2C_OK) {
		printf("INA219 not found\n");
		return;
	}

	uint16_t powerLSB = 2;    	// 2uW per bit
	ret = i2c_write_reg(&dev_ina219, 0x00, (uint8_t[]){0x39, 0x9F}, 2);		// Configure INA219 32V 1A Range

	// 2. Set calibration for 1A range (assuming 0.1Ω shunt)
	uint16_t cal = 4096;  // 0.04096 / (0.0001 * 0.1)
	uint8_t cal_bytes[2] = {cal >> 8, cal & 0xFF};
	i2c_write_reg(&dev_ina219, 0x05, cal_bytes, 2);

	ret = i2c_read_reg(&dev_ina219, 0x01, buff, 2);		// Read shunt voltage
	uint16_t shunt_raw = (buff[1] << 8) | buff[0];
	uint16_t shunt = shunt_raw / 100;					// in mV

	ret = i2c_read_reg(&dev_ina219, 0x02, buff, 2);		// Read bus voltage
	uint16_t bus_raw = (buff[1] << 8) | buff[0];
	uint16_t bus = (shunt_raw >> 3) * 4;				// in mV

	ret = i2c_read_reg(&dev_ina219, 0x03, buff, 2);		// Read power
	uint16_t power_raw = (buff[1] << 8) | buff[0];
	uint16_t power = power_raw * powerLSB;				// in uW

	ret = i2c_read_reg(&dev_ina219, 0x04, buff, 2);		// Read current
	uint16_t current_raw = (buff[1] << 8) | buff[0];
	uint16_t current = current_raw;						// in mA

	printf("INA219 Shunt: %duV, Bus: %duV, Current: %duA\n\n", shunt, bus, current);
}


