unicab369/CH-Mess/ch32-mess/2_Device/mng_i2c.h
uint8_t decimal_to_bcd(uint8_t val) { return ((val/10)*16) + (val%10); }
uint8_t bcd_to_decimal(uint8_t val) { return ((val/16)*10) + (val%16); }

void test_ds3231() {
	ret = i2c_write_reg(&dev_ds3231, 0x00, (uint8_t[]){
		decimal_to_bcd(9),		// seconds
		decimal_to_bcd(58),		// minutes
		decimal_to_bcd(11),		// hours
		decimal_to_bcd(1),		// day of the week
		decimal_to_bcd(15),		// date
		decimal_to_bcd(7),		// month
		decimal_to_bcd(25),		// year
	}, 7);	// Reset ds3231
	printf("Error0: %d\n", ret);

	ret = i2c_read_reg(&dev_ds3231, 0x00, buff, 7);
	printf("Error1: %d\n", ret);

	// print date and time
	printf("%d/%d/%lu %d:%d:%d\n", 
		bcd_to_decimal(buff[4]), bcd_to_decimal(buff[5]), bcd_to_decimal(buff[6]) + 2000,
		bcd_to_decimal(buff[2]), bcd_to_decimal(buff[1]), bcd_to_decimal(buff[0]));
}

void test_at24c() {
	ret = i2c_write_raw(&dev_at24c, (uint8_t[]){ 0x00, 0x11, 0xDD }, 3);
	printf("Error0: %d\n", ret);

	Delay_Ms(10);
	ret = i2c_write_raw(&dev_at24c, (uint8_t[]){ 0x00, 0x11 }, 2);
	ret = i2c_read_raw(&dev_at24c, buff, 1);
	printf("Error1: %d\n", ret);
	printf("0x%02X\n", buff[0]);
}

void i2c_device_tests() {
	// test_htu21();				//! NOT WORKING
	// test_aht21();
	// test_bmp280();
	// test_hdc1080();
	// test_si7021();
	// test_max44009();
	// test_ap3216();
	// test_vl53l0x();			//! NOT WORKING
	// test_ens160();
	// test_sgp30();
	// test_scd40();
	// test_mpu6050();
	// test_adxl345();
	// test_ds3231();
	// test_at24c();
	// test_ina3221();			//! NOT WORKING
	// test_as5600();
	// test_max30102();
	// test_amg88xx();
	// test_bh1750();
	// test_sht3x();
	// test_apds9960();
	// test_ina219();
}

char str_output[SSD1306_STR_SIZE];


void test_v003Slave() {
	if (i2c_ping(dev_v003Slave.addr) != I2C_OK) {
		printf("v003Slave not found\n");
		return;
	}

	ret = i2c_read_reg(&dev_v003Slave, 0x00, buff, 3);
	printf("v003Slave: %02X, %02X, %02X\n", buff[0], buff[1], buff[2]);

	ret = i2c_write_reg(&dev_v003Slave, 0x01, (uint8_t[]){0x11, 0x22}, 2);

	ret = i2c_read_reg(&dev_v003Slave, 0x00, buff, 3);
	printf("v003Slave: %02X, %02X, %02X\n", buff[0], buff[1], buff[2]);
}

void modI2C_display(const char *str, uint8_t line) {
	//! validate device before print
	if (i2c_ping(0x3C) != I2C_OK) return;
	ssd1306_print_str_at(str, line, 0);
}

void i2c_scan_callback(const uint8_t addr) {
	if (addr == 0x00 || addr == 0x7F) return; // Skip reserved addresses
	
	static int line = 1;
	sprintf(str_output, "I2C: 0x%02X", addr);
	printf("%s\n", str_output);
	modI2C_display(str_output, line++);
}

void modI2C_setup() {
	if(i2c_init(&dev_aht21) != I2C_OK) {
		printf("Failed to init I2C\n");
	} else {
		if (i2c_ping(0x3C) == I2C_OK) {
			ssd1306_setup();

			sprintf(str_output, "Hello Bee!");
			ssd1306_print_str_at(str_output, 0, 0);
		}

		// Scan the I2C Bus, prints any devices that respond
		printf("----Scanning I2C Bus for Devices---\n");
		i2c_scan(i2c_scan_callback);
		printf("----Done Scanning----\n\n");
	}

	// i2c_device_tests();
	// test_v003Slave();
}


#define PRINT_BUFF_SIZE 5

typedef struct PACKED {
	char str[SSD1306_STR_SIZE];
	uint8_t line_num;		// line_num = 0 means empty
} PrintBuff_t;


uint32_t lock_printTime = 0;
uint8_t printBuff_idx = 0;
PrintBuff_t printBuff[PRINT_BUFF_SIZE] = { 0 };
uint8_t flag_printBuff_data = 1;					// set to 1 to allow initial print

void mngI2c_load_printBuff(const char *str, uint8_t line_idx) {
	flag_printBuff_data = 1;
	PrintBuff_t *buff = &printBuff[printBuff_idx];
	buff->line_num = line_idx + 1;
	strncpy(buff->str, str, SSD1306_STR_SIZE);
	// buff->str[24] = '\0';
	printBuff_idx = (printBuff_idx + 1) % PRINT_BUFF_SIZE;
}

uint32_t line6_preserve_time = 0;

void mngI2c_load_joystick(uint32_t time, uint16_t x, uint16_t y) {
	// keep line6_preserve_time shown for at least 1 second
	if (time - line6_preserve_time < 1000) return;

	sprintf(str_output, "jx: %d, jy: %d", x, y);
	mngI2c_load_printBuff(str_output, 6);
}

void mngI2c_load_buttonState(uint32_t time, uint8_t state) {
	line6_preserve_time = time;

	sprintf(str_output, "button: %d", state);
	mngI2c_load_printBuff(str_output, 6);
}

void mngI2c_load_encoder(uint32_t time, uint8_t pos, uint8_t dir) {
	line6_preserve_time = time;

	sprintf(str_output, "pos: %d, dir: %s", pos, dir ? "CW" : "CCW");
	mngI2c_load_printBuff(str_output, 6);
}

char loading_char[4] = "\\";

void cycle_loading_char() {
    // Since we're only dealing with single characters, we can just check the first byte.
    // This is faster and safer than strcmp/strcpy.
    switch(loading_char[0]) {
        case '\\':	strcpy(loading_char, "|"); break;
        case '|':	strcpy(loading_char, "/"); break;
        case '/':	strcpy(loading_char, "-"); break;
        case '-':	strcpy(loading_char, "\\"); break;
    }
}

void mngI2c_loadCounter(uint32_t counter, uint32_t runTime) {
	sprintf(str_output, "%s cyc/s %lu ~ %lums", loading_char, counter, runTime);
	mngI2c_load_printBuff(str_output, 7);
	cycle_loading_char();
}

void mngI2c_printBuff_task() {
	if (!flag_printBuff_data) return;

	for (int i = 0; i < PRINT_BUFF_SIZE; i++) {
		if (printBuff[i].line_num == 0) continue;
		modI2C_display(printBuff[i].str, printBuff[i].line_num-1);
	}

	//! Clear printBuff
	memset(printBuff, 0, sizeof(printBuff));
	flag_printBuff_data = 0;
}
